swiftgeek/t2k-c8051/mscbemb.h
/********************************************************************\

  Name:         mscbemb.h
  Created by:   Stefan Ritt

  Contents:     Midas Slow Control Bus protocol commands

  $Id$

\********************************************************************/

/*---- map small defines from makefile to capital defines ----------*/

#ifdef scs_210
#define SCS_210
#endif
#ifdef scs_220
#define SCS_220
#endif
#ifdef subm_250
#define SUBM_250
#endif
#ifdef subm_300
#define SUBM_300
#endif
#ifdef scs_300
#define SCS_300
#endif
#ifdef scs_310
#define SCS_310
#endif
#ifdef scs_320
#define SCS_320
#endif
#ifdef scs_400
#define SCS_400
#endif
#ifdef scs_500
#define SCS_500
#endif
#ifdef scs_520
#define SCS_520
#endif
#ifdef scs_600
#define SCS_600
#endif
#ifdef scs_700
#define SCS_700
#endif
#ifdef scs_800
#define SCS_800
#endif
#ifdef scs_900
#define SCS_900
#endif
#ifdef scs_910
#define SCS_910
#endif
#ifdef scs_920
#define SCS_920
#endif
#ifdef scs_1000
#define SCS_1000
#endif
#ifdef scs_1001
#define SCS_1001
#endif
#ifdef scs_2000
#define SCS_2000
#endif
#ifdef hvr_200
#define HVR_200
#endif
#ifdef hvr_400
#define HVR_400
#endif
#ifdef hvr_500
#define HVR_500
#endif
#ifdef hvr_800
#define HVR_800
#endif
#ifdef hvr_test
#define HVR_TEST
#endif
#ifdef meg_splt_bp   // MEG experiment "Lecce" splitter backplane
#define MEG_SPLT_BP
#endif
#ifdef   fgd_008     // T2K-FGD SiPM 8-channel bias board K. Mizouchi Sep/19/2006
#define  FGD_008
#endif
#ifdef tsr           // Temperature Sensor Array Readback    Brian Lee May 05/2007
#define TSR
#endif
#ifdef t2kasum       // T2K-ASUM test board          Brian Lee June 07/2007
#define T2KASUM
#endif
#ifdef	feb64
#define FEB64
#endif
#ifdef	temp36
#define TEMP36
#endif
#ifdef	loader
#define  LOADER
#endif
#ifdef   cmb
#define  CMB
#endif
#ifdef titan_rf      // GPIB
#define TITAN_RF
#endif
#ifdef rf_gpib_310      // GPIB
#define RF_GPIB_310
#endif
#ifdef ccbertan_gpib_410      // GPIB
#define CCBERTAN_GPIB_410
#endif
#ifdef treval_12x    // Evaluation card
#define TREVAL_12X
#endif
#ifdef p0dps
#define P0DPS
#endif

/*---- CPU specific items ------------------------------------------*/

/* default flags */
#define USE_WATCHDOG
#define HAVE_EEPROM

/*--------------------------------*/
#if defined(SCS_210)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P3 ^ 4
#define LED_1 P3 ^ 3
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;

/*--------------------------------*/
#elif defined(SCS_220)
#include <c8051F020.h>
#define CPU_C8051F020

#define LED_0 P3 ^ 4
#define LED_1 P3 ^ 3
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;
sbit RS485_SEC_ENABLE = P0 ^ 6;

/*--------------------------------*/
#elif defined(SUBM_250)
#include "c8051F320.h" // don't use the one from Keil !!
#define CPU_C8051F320

#define LED_0 P1 ^ 2
#define LED_1 P1 ^ 3
#define LED_ON 0
sbit RS485_ENABLE = P1 ^ 0;

//#define EXT_WATCHDOG
//sbit EXT_WATCHDOG_PIN = P2 ^ 1;

#undef HAVE_EEPROM

/*--------------------------------*/
#elif defined(SUBM_260)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P0 ^ 2
#define LED_1 P0 ^ 3
#define LED_ON 0
sbit RS485_ENABLE = P0 ^ 4;

#undef HAVE_EEPROM

/*--------------------------------*/
#elif defined(SCS_300) || defined(SCS_310)
#include <c8051F020.h>
#define CPU_C8051F020

#define LED_0 P3 ^ 3
#define LED_1 P3 ^ 4
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;

/*--------------------------------*/
#elif defined(SCS_320)
#include <c8051F320.h>
#define CPU_C8051F320

#define LED_0 P2 ^ 7
#define LED_ON 0
sbit RS485_ENABLE = P0 ^ 3;

/*--------------------------------*/
#elif defined(SUBM_300)
#include <c8051F020.h>
#define CPU_C8051F020

#define LED_0 P3 ^ 3
#define LED_1 P3 ^ 4
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;

#undef HAVE_EEPROM

/*--------------------------------*/
#elif defined(SCS_400) || defined(SCS_500)
#include <c8051F000.h>
#define CPU_C8051F000

#define LED_0 P3 ^ 4
#define LED_ON 1
sbit RS485_ENABLE = P3 ^ 5;

/*--------------------------------*/
#elif defined(SCS_520) || defined(SCS_600) || defined(SCS_700) || defined (SCS_800) || defined (SCS_900) || defined (SCS_910) || defined(CFD_950)
#include <c8051F000.h>
#define CPU_C8051F000

#define LED_0 P3 ^ 4
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;

/*--------------------------------*/
#elif defined (SCS_920)
#include <c8051F000.h>
#define CPU_C8051F000

#define LED_0 P3 ^ 4
#define LED_ON 1
sbit RS485_ENABLE = P3 ^ 5;

/*--------------------------------*/
#elif defined(SCS_1000)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P2 ^ 0
#define LED_1 P0 ^ 6
#define LED_2 P0 ^ 7 // buzzer
#define LED_ON 1     // will be zero when 2981 will be used instead of 2982
sbit RS485_ENABLE = P0 ^ 5;
sbit RS485_SEC_ENABLE = P0 ^ 4;

#define HAVE_LCD

/*--------------------------------*/
#elif defined(SCS_1001)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P2 ^ 0
#define LED_1 P0 ^ 6
#define LED_2 P0 ^ 7 // buzzer
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 5;
sbit RS485_SEC_ENABLE = P0 ^ 4;

//#define EXT_WATCHDOG              // use external watchdog
sbit EXT_WATCHDOG_PIN = P1 ^ 4;

#define HAVE_LCD

/*--------------------------------*/
#elif defined(SCS_2000)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P0 ^ 6
#define LED_1 P0 ^ 7
#define LED_ON 0
sbit RS485_ENABLE = P0 ^ 5;
sbit RS485_SEC_ENABLE = P0 ^ 4;

//#define EXT_WATCHDOG              // use external watchdog
//sbit EXT_WATCHDOG_PIN = DAC0;

#define HAVE_LCD
#define LCD_8BIT
#define DYN_VARIABLES
#define HAVE_RTC

/*--------------------------------*/
#elif defined(HVR_200)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P1 ^ 6
#define LED_1 P1 ^ 7
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 5;

/*--------------------------------*/
#elif defined(HVR_400)
#include <c8051F310.h>
#define CPU_C8051F310

#define LED_0 P2 ^ 4
#define LED_1 P2 ^ 5
#define LED_2 P2 ^ 6
#define LED_3 P2 ^ 7
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 7;

/*--------------------------------*/
#elif defined(HVR_500)
#include <c8051F310.h>
#define CPU_C8051F310

#define LED_0 P2 ^ 7
#define LED_1 P2 ^ 6
#define LED_2 P2 ^ 5
#define LED_3 P2 ^ 4
#define LED_4 P2 ^ 3
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 7;

/*--------------------------------*/
#elif defined(HVR_800)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P1 ^ 7
#define LED_1 P1 ^ 6
#define LED_2 P1 ^ 5
#define LED_3 P1 ^ 4
#define LED_4 P1 ^ 3
#define LED_5 P1 ^ 2
#define LED_6 P1 ^ 1
#define LED_7 P1 ^ 0
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 5;

/*--------------------------------*/
#elif defined(HVR_TEST)
#include <c8051F000.h>
#define CPU_C8051F000

#define LED_0 P3 ^ 4
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;

/*--------------------------------*/
#elif defined(MEG_SPLT_BP)
#include <c8051F120.h>
#define CPU_C8051F120

