swiftgeek/t2k-c8051/mscbemb.h
// SST
#define MORE_THAN_ONE_LINE	//2 SST Lines
#define MSCB_SST1 P0^3 //SST1 line  SST_IO (Write/Push-Pull)
#define MSCB_SST2 P0^4
#define SST_ClientResponse1 (char) ((CPT0CN & 0x40) >> 6) //Comparator1 overflow bit
#define SST_ClientResponse2 (char) ((CPT1CN & 0x40) >> 6)

// SPI
#define MSCB_SPI_SCK  P2 ^ 4
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 5 

// EEPROM
#define RAM_CHIP_SELECT    P2 ^ 0
#define RAM_HOLD_DOWN      P2 ^ 3
#define RAM_WRITE_PROTECT  P2 ^ 2

// SHT
#define SHT_DATA1 P1^2
#define SHT_SCK1  P1^0
#define SHT_DATA2 P1^6
#define SHT_SCK2  P1^4

#define HAVE_RTC
//
/*---------LOADER-----------------------*/
#elif defined(LOADER)
#include <c8051F120.h>
#define CPU_C8051F120

#if defined(LED_1) 
#undef LED_1
#endif
// sbit DEBUG_PIN = P3 ^ 3;
   

//
// FEB64 Loader
//-----------------------------------------------------------------------
#ifdef L_FEB64
//
// P3.7:RAMCSn   .6:CSn6      .5:CSn4     .4:SPARE5  | .3:SPARE4  .2:REG_EN   .1:CSn3    .0:CSn2 
// P2.7:SPARE1   .6:CSn7      .5:CSn6     .4:SPIMOSI | .3:SPISCK  .2:RAMHLDn  .1:SPIMISO .0:RAMWPn 
// P1.7:ASUMSync .6:ASUMTestn .5:ASUMPWDn .4:ASUMCSn | .3:ResetN  .2:SPARE2   .1:SPARE3  .0:SST_DRV 
// P0.7:CSn1     .6:CSn0      .5:485TXEN  .4:QPUMPCLK| .3:SMBCLK  .2:SMBDAT   .1:Rx      .0:Tx 

// SMB  Port is fixed, XBR0 set in mscbmain

// SPI
#define MSCB_SPI_SCK  P2 ^ 3
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 4

// EEPROM
#define RAM_CHIP_SELECT    P3 ^ 7
#define RAM_HOLD_DOWN      P2 ^ 2
#define RAM_WRITE_PROTECT  P2 ^ 0
// RS485
#define LED_0 P2 ^ 7 
sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low

//
// CMB Loader
//-----------------------------------------------------------------------
#elif defined(L_CMB)
// SPI
#define MSCB_SPI_SCK  P1 ^ 2
#define MSCB_SPI_MISO P1 ^ 6
#define MSCB_SPI_MOSI P1 ^ 1

//EEPROM
#define RAM_CHIP_SELECT    P1 ^ 7
#define RAM_HOLD_DOWN      P1 ^ 3
#define RAM_WRITE_PROTECT  P1 ^ 5

#define LED_0 P2 ^ 2 
sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low

//
// LPB Loader
//-----------------------------------------------------------------------
#elif defined(L_LPB)
//
// P3.7:A7       .6:A6        .5:A5       .4:A4      | .3:A3      .2:A2       .1:A1      .0:A0 
// P2.7:+1.8En   .6:+3.3En    .5:+5En     .4:SPIMOSI | .3:SPISCK  .2:RAMHLDn  .1:SPIMISO .0:RAMWP
// P1.7:NC       .6:+6ddFlag  .5:R/HClock .4:R/HData | .3:+6ddEN  .2:RAMCS    .1:NC      .0:SST_DRV 
// P0.7:DEL_CLK  .6:DEL_DATA  .5:485TXEN  .4:NC      | .3:DELCS1  .2:DELCS2   .1:Rx      .0:Tx 

// SPI
#define MSCB_SPI_SCK  P2 ^ 3
#define MSCB_SPI_MOSI P2 ^ 4
#define MSCB_SPI_MISO P2 ^ 1

//EEPROM
#define RAM_CHIP_SELECT    P1 ^ 2
#define RAM_HOLD_DOWN      P2 ^ 2
#define RAM_WRITE_PROTECT  P2 ^ 0
#define LED_0 P0 ^ 4
sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low

//
// TEMP36 Loader
//-----------------------------------------------------------------------
#elif defined(L_TEMP36)
// SPI
#define MSCB_SPI_SCK  P2 ^ 4
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 5

//EEPROM
#define RAM_CHIP_SELECT    P2 ^ 0
#define RAM_HOLD_DOWN      P2 ^ 3
#define RAM_WRITE_PROTECT  P2 ^ 2
#define LED_0 P2 ^ 7 
#define LED_1 P2 ^ 6
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 2; //MSCB communication enable port

#endif  // LOADER 

/*--------------------------------*/
#elif defined(POWER_SWITCH) //
#include <c8051F310.h>
#define CPU_C8051F310
#define SUCCESS 0
#define FAILED  -1
#define LED_0 P3 ^ 0

// #define LED_1 P3 ^ 1
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 3;

//SST //NW modified MSCB_SST1
#define MSCB_SST1 P2 ^ 6 //SST1 line  SST_IO (Write/Push-Pull) 
#define SST_ClientResponse1 (char) ((CPT1CN & 0x40) >> 6) //Comparator1 overflow bit

/*--------------------------------*/
#elif defined(CCBERTAN_GPIB_410)
#include <c8051F410.h>
#define CPU_C8051F410

#define LED_0 P0 ^ 7
#define LED_1 P0 ^ 2
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 6;

/*--------------------------------*/
#elif defined(GPIB_TEST)
#include <c8051F020.h>
#define CPU_C8051F020

#define LED_0 P3 ^ 3
#define LED_1 P3 ^ 4
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;
/*--------------------------------*/
#elif defined(TITAN_RF)
#include <c8051F310.h>   // 120-ver2
#define CPU_C8051F310

#define LED_0 P3 ^ 4     // 3-ver2
#define LED_1 P3 ^ 3     // 4-ver2
#define LED_ON 0
sbit RS485_ENABLE = P3 ^ 5;
/*--------------------------------*/
#elif defined(RF_GPIB_310)
#include <c8051F310.h>
#define CPU_C8051F310

#define LED_0 P0 ^ 6
#define LED_1 P0 ^ 2
#define LED_ON 0
sbit RS485_ENABLE = P0 ^ 3;
/*--------------------------------*/
#elif defined(TREVAL_12X)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P1 ^ 6
#define LED_1 P1 ^ 7
#define LED_ON 0
sbit RS485_ENABLE = P0 ^ 2;
/*--------------------------------*/
#elif defined(P0DPS)
#include <c8051F410.h>
#define CPU_C8051F410
sbit RS485_ENABLE = P0 ^ 6;
#define LED_0 P0 ^ 2
#define LED_1 P0 ^ 7
#define LED_ON 1
#else
#error Please define SCS_xxx or HVR_xxx in project options
#endif

#define LED_OFF !LED_ON

#if defined(LED_7)
#define N_LED 8
#elif defined(LED_6)
#define N_LED 7
#elif defined(LED_5)
#define N_LED 6
#elif defined(LED_4)
#define N_LED 5
#elif defined(LED_3)
#define N_LED 4
#elif defined(LED_2)
#define N_LED 3
#elif defined(LED_1)
#define N_LED 2
#elif defined(LED_0)
#define N_LED 1
#else
#define N_LED 0
#endif

/* map SBUF0 & Co. to SBUF */
#if !defined(CPU_C8051F020) && !defined(CPU_C8051F120) && !defined(CPU_C8051F310) && !defined(CPU_C8051F320)&& !defined(CPU_C8051F410)
#define SCON0    SCON
#define SBUF0    SBUF
#define TI0      TI
#define RI0      RI
#define RB80     RB8
#define ES0      ES
#define PS0      PS
#endif

#if defined(CPU_C8051F020) || defined(CPU_C8051F120)
#define PS0      PS
#endif

#if defined(CPU_C8051F310) || defined(CPU_C8051F320)
#define EEPROM_OFFSET 0x3A00 // 0x3A00-0x3BFF = 0.5kB, 0x3C00 cannot be erased!
#define N_EEPROM_PAGE      1 // 1 page  @ 512 bytes
#elif defined(CPU_C8051F120)
#define EEPROM_OFFSET 0xE000 // 0xE000-0xEFFF = 4kB
#define N_EEPROM_PAGE      8 // 8 pages @ 512 bytes
#elif defined(CPU_C8051F410)
#define EEPROM_OFFSET 0x6000 // 0x6000-0x63FF = 1kB
#define N_EEPROM_PAGE      2 // 8 pages @ 512 bytes
#else
#define EEPROM_OFFSET 0x6000 // 0x6000-0x6FFF = 4kB
#define N_EEPROM_PAGE      8 // 8 pages @ 512 bytes
#endif


/* UART1 specific definitions */
#if defined(SCS_210) | defined(SCS_220)
#define UART1_DEVICE                     // use direct device communication
#endif

#if defined(UART1_DEVICE) && defined(HAVE_LCD)
char putchar1(char c);                   // putchar cannot be used with LCD support
#endif

